java/json.org
* json简介
** javaScript Object Notation
*** 描述
  - 一种轻量级的数据交换格式
*** 优点
  - 文本格式保存
  - 数据传输性能比xml要高出很多
*** 结构
  - Name-Value  键值对
  - Value 有序列表
* json数据格式解析
** 简单类型数据
*** 字符
 - 除了" \ / 和控制符外,其他unicode直接输出
*** 数值
 - 同其他语言
** 对象数据
*** 数组格式
 - ["abc",12345,fase,null]
*** 复杂嵌套
 - {"name":"json","address":{"city":"dalian","street":"xigang"}}
* javaScript处理json数据
** javaScript处理json例子
#+BEGIN_SRC js
function handleJson() { 
 var j={"name":"Michael","address":
     {"city":"Beijing","street":" Chaoyang Road ","postcode":100025}
 }; 
 document.write(j.name); 
 document.write(j.address.city); 
}
#+END_SRC
** 接收从服务器传递来的json数据
#+BEGIN_SRC js
 new Ajax.Request("http://url", { 
  method: "get", 
  onSuccess: function(transport) { 
    var json = transport.responseText.evalJSON(); 
    // TODO: document.write(json.xxx); 
  } 
 });
#+END_SRC

* 服务器端输出json格式数据
** string对象转为json数据
#+BEGIN_SRC  java
 static String string2Json(String s) { 
    StringBuilder sb = new StringBuilder(s.length()+20); 
    sb.append('\"'); 
    for (int i=0; i<s.length(); i++) { 
        char c = s.charAt(i); 
        switch (c) { 
        case '\"': 
            sb.append("\\\""); 
            break; 
        case '\\': 
            sb.append("\\\\"); 
            break; 
        case '/': 
            sb.append("\\/"); 
            break; 
        case '\b': 
            sb.append("\\b"); 
            break; 
        case '\f': 
            sb.append("\\f"); 
            break; 
        case '\n': 
            sb.append("\\n"); 
            break; 
        case '\r': 
            sb.append("\\r"); 
            break; 
        case '\t': 
            sb.append("\\t"); 
            break; 
        default: 
            sb.append(c); 
        } 
    } 
    sb.append('\"'); 
    return sb.toString(); 
 } 
#+END_SRC
** 数值转为json类型
#+BEGIN_SRC java
 static String number2Json(Number number) { 
    return number.toString(); 
 }
#+END_SRC
** Boolean转为json类型
#+BEGIN_SRC js
 static String boolean2Json(Boolean bool) { 
    return bool.toString(); 
 } 
#+END_SRC
** 数组编码为json
#+BEGIN_SRC java
 static String array2Json(Object[] array) { 
    if (array.length==0) 
        return "[]"; 
    StringBuilder sb = new StringBuilder(array.length << 4); 
    sb.append('['); 
    for (Object o : array) { 
        sb.append(toJson(o)); 
        sb.append(','); 
    } 
    // 将最后添加的 ',' 变为 ']': 
    sb.setCharAt(sb.length()-1, ']'); 
    return sb.toString(); 
 } 
#+END_SRC
** map编码为json
#+BEGIN_SRC java
static String map2Json(Map<String, Object> map) { 
    if (map.isEmpty()) 
        return "{}"; 
    StringBuilder sb = new StringBuilder(map.size() << 4); 
    sb.append('{'); 
    Set<String> keys = map.keySet(); 
    for (String key : keys) { 
        Object value = map.get(key); 
        sb.append('\"'); 
        sb.append(key); 
        sb.append('\"'); 
        sb.append(':'); 
        sb.append(toJson(value)); 
        sb.append(','); 
    } 
    // 将最后的 ',' 变为 '}': 
    sb.setCharAt(sb.length()-1, '}'); 
    return sb.toString(); 
 } 
#+END_SRC
** 统一方法
#+BEGIN_SRC java
 public static String toJson(Object o) { 
    if (o==null) 
        return "null"; 
    if (o instanceof String) 
        return string2Json((String)o); 
    if (o instanceof Boolean) 
        return boolean2Json((Boolean)o); 
    if (o instanceof Number) 
        return number2Json((Number)o); 
    if (o instanceof Map) 
        return map2Json((Map<String, Object>)o); 
    if (o instanceof Object[]) 
        return array2Json((Object[])o); 
    throw new RuntimeException("Unsupported type: " + o.getClass().getName()); 
 } 
#+END_SRC
* 输出json数据
#+BEGIN_SRC java
 response.setContentType("application/json;charset=UTF-8"); 
 response.setCharacterEncoding("UTF-8"); 
 PrintWriter pw = response.getWriter(); 
 pw.write(JsonUtil.toJson(obj)); 
 pw.flush();
#+END_SRC
